// //! 1 тапшырма 

// let arr = [1,2,3,4,5];
// alert(arr[0])



// //! 2 тапшырма 

// let arr1 = [1,2,3,4,5];
// alert(arr1[4])

// //! 3 тапшырма 

// let arr2 = [1,2,3,4,5];
// arr2.push(6)
// alert(arr2)


// //! 4 тапшырма 
// let arr3 = [1,2,3,4,5,6,7];
// alert(arr3.length)




console.log(Math.pow(5,2));

//! Эгер сан 10 дон чоң болсо "Чоң сан" болбосо "Кичине сан " чыксын 

// let num = 9;
// if(num > 10){
//     alert("Чоң сан ")
// }
// else{
//     alert("Кичиникей сан")
// }




//! Эрмек канча баал алды
// let num1 = prompt("Канча бал алдың Эрмек сен ");
// if(num1 < 49){
//     alert("Начар бал")
// }
// else if(num1 < 70){
//     alert("Жакшы бал")
// }
// else{
//     alert("Аябай сонун")
// }


//! Жупу же такпы текшер 

// let num2 = prompt("Сан жаз");
// if(num2 % 2 === 0 ){
//     alert("Жуп сан")
// }
// else{
//     alert("Так сан")
// }




// ! 25 градусс кандай экенин текшер 

// let num3 = 25;
// if(num3 >= 30){
//     alert("Ысык")
// }
// else if(num3 >= 15){
//     alert("Жылуу")
// }
// else{
//     alert("Суук")
// }

//?  2) варианты

// let num4 = prompt("Азыр эшикте канча градус ? ");
// if(num4 >= 30){
//     alert("Ысык")
// }
// else if(num4 >= 15){
//     alert("Жылуу")
// }
// else{
//     alert("Суук")
// }










// !                                            && менен || Тема 





//! Баланын иштей турган жашыбы ?

// let age = 20;

// if(age >= 18 && age <= 60){
//     alert("Иштей турган жаш")
// }
// else{
//     alert("Иштебейт")
// }



// !  Бугун жумуш барбы ?
 
// let day = "Жумуш бар"
// if( day === "Жумуш жок" || day === "Жумуш бар"){
//     alert("Бүгүң жумушка барасың")
// }
// else{
//     alert(" Бүгүн жумушка барбайсың")
// }




//! Комбо менен  Мисал 

// let age2 = 15;
// let parent = true;
// if ( age >= 18 || parent === true){
//     alert("Кирсе болот ")
// }
// else{
//     alert("Кирсе болбойт ")
// }





//!                                             Тапшырма 1

let age3 = 17;
let ticket = true;
if(age3 >= 18 && ticket === true){
    alert("Кирсе болот ")
}

else{
    alert("Кирсе болбойт ")
}


//!                                             Тапшырма 2

let Пагода = "Жамгыр";
if ( Пагода === "Жамгыр" || Пагода  === " Күн ачык "){
    alert("Чыкпа сыртка")
}
else{
    alert("Чыга бер  сыртка")
}