// let a = 5;
// if(a == 1 || a == 2 || a == 3){
//     alert('1');
// }
// else if(a == 4 ){
//     alert('2');
// }
// else if(a == 5){
//     alert('3');
// }
// else{
//     alert("Эч нерсе жок")
// }

let n = Number(prompt("Канчa адам өтүшү керек (n)?"));
let k = Number(prompt("Кайык биринчи жолу канча адам ташый алат (k)?"));

let Er = (k * (k + 1)) / 2; // k + (k-1) + ... + 1 суммасы

if (Er >= n) {
    alert("Баары өтө алат! ");
} else {
    alert("Баары өтө албайт!");
}










// function canCross(n, k) {
//     // k + (k-1) + ... + 1 суммасын табабыз
//     let total = (k * (k + 1)) / 2;  // формула: сумма ариф.прогрессии

//     if (total >= n) {
//         console.log("Баары өтө алат!");
//     } else {
//         console.log("Баары өтө албайт!");
//     }
// }

// // Мисал (мисалда k = 4 → сумма = 10)
// canCross(10, 4);   // Баары өтө алат!
// canCross(15, 4);   // Баары өтө албайт!


