// let ER1 = confirm("Сен Шаурма заказ кылгың келеби ?");

// if (ER1) {

//     let ER2 = prompt("Кандай Шаурма каалайсың?");
//     alert("Сен заказ кылдың " + ER2);
// } else {

//     alert("Анда кайсыны заказ кыласың ?");
// }

                    //! 2 Вариант


// let E1 = confirm("Кош келипсиң эмне Заказ кыласың бизде бары бар Шаурма бургер Пицаа бары бар заказ кыласыңбы ?")
// if(E1){
//     let E2 = prompt("Эмне заказ кыласың ?")
//     alert("Cен " + E2 + " заказ кылдың " + " Эми 1 минут күтүп тур")
// }else{
//     alert("Анда кайсыны заказ кыласың ?")
// }

