// function ER1 (a, b){
//     return a + b;
// }
// console.log(ER1(10,2));


// function ER(){
//     let ER1 = prompt('Ermek');
//     let ER2 = 123;

    // alert(ER1);
//     alert(ER2);

// }

// ER();


// function a1(at){
//     console.log("Салам " + at + "!");
    
// }
// a1("Карима апче")
// a1("Эрмек")


// function ER1(){
//     let E1 = "Ermek";
//     let E2 = 12345;
//     alert("Атың " + E1);
//     alert('Бул парол ' + E2);

// }
// ER1()



//! Глабалный внешняя функ 

let ER1 = "Ermek "
let ER2 = 13;
function ER3(){   // Буну  div десек болот 
    let Erm1 = "Erma"
    let Erm2 = "Erbol "
    alert(Erm1);
    alert(Erm2)
    alert(ER1 + ER2);

}


ER3()  // Анан div Ушул жерден токтойт 





// //! Практика Параметр 

//  function Група1(EM1, EM2){
//     prompt(EM1 + " " + EM2);

//  }
//  Група1('Ermek', '13')


// function E1(Em1,Em2){
//     prompt(Em1)
//     alert(Em2)
    
// }
// E1("Атың ким ? ","Сен кирдиң")
 
// function E2(Em3,Em4){
//     alert(Em3);
//     alert(Em4);
// }
// E2("Эрмек","Эрма")


// function E3(Em5,Em6,Em7){
//     alert(Em5 * Em6 + Em7)
// }
// E3(4,2,10)


// //! Параметры бар Код Кыска жолу

function ER1(E1 = "Ermek", E2 = "Айтишник"){ // Бул жерден параметирди анан малыматы кошуп койгон бир жерге Кыскартып
    alert(E1 + " " +  E2 ) // Бул кошот Параметирди анан Малыматы 
}
ER1(); // Бул жерден биз ER1 ди чакырып эле койобуз

// //! Параметры бар Код 

// function ER2(E3,E4){    // Бул жака мен Параметр койдум мындай айтканда Малыматын аты
//     alert(E3 + " " + E4) // Бул малыматарды кошот
// }
// ER2("Ermek", "13")// Бул малымат








//! Бул кайтаруучу функция

// function ER3(a, b){ // Бул Параметрирдин аты
//     return a + b // Бул босло Параметирди кошуп берет 
// }

// console.log(ER3(2,6)); // Бул жака малымат жазып туруп console.log го чыгарып берет же alert го
// alert(ER3(2,6));



// //! Параметр if else боюнча  Практика

// function E6(ER1){ // Бул параметр аты
//     if(ER1 < 18){   // 18 жашка тең болсо права алат
//         return " Берилбейт"
//     }

//     else{
//         return " Берилет права"
//     }

    
// }
// console.log(E6(17)); // Бул  малымат Мислаы мен 17 жаштамын деген


