



// //? Тапшырма сандарды 10 9 8 7 6 5 4 3 2 1 чыгарыш керек

// //! 1 Вариант
// let E = prompt("Канча санга чейин чыгарасың ?"); // Бул жерден 10 сан десем 10 санга чейин чыгарып берет 
// while(E > 1){
//     E--;    // Бул жерден минус койуп койдум Тескери кетиш үчүн сан
//     // alert(E + "E");
//     console.log(E + "E"); 
    


// }

// // //! 2 Вариант

// for(E1 = 10; E1 > 0; E1--){    // Буну for менен иштетип көрдүм
//     // alert(E1 + "E");
//     console.log(E1 + " Эрмек");  // Бул жерден 1 Эрмек деп чыгат
    

    
// }



// for ( E1 = 0; E1 < 4; E1++){
//     console.log(E1);
    
// }
// console.log("Сан бүтү");


// //! Тапшырма мен бүгүн канча кадам басытм ?

// let ER1 = prompt("Атың ким ") // Бул жерден мен атымды жазам 
// let ER2 = confirm(ER1 + " Сен бүгүн кадам кылдыңбы ?") // Бул жерден confirm суроо берет (Сен бүгүн кадам кылдыңбы) деп
// if(ER2){ // Эсли Оа десем ушул код иштейт 
//     alert("Аа жакшы ")
//     let ER3 = prompt(ER1 + " Сен бүгүн канча кадам кылдың ?") // Бул жерден калаган санды жасам болот 
//     for( E1 = 1; E1 < ER3; E1++){
//         console.log (E1 );
 
        
//         }
//         console.log(ER1 + " Сен бүгүн " + ER3 + " кадам кылдың"); // Бул жерден полный Канча кадам 
//         // басканымды чыгарып берет  console.log го

// }else{ // Жок десем ушул код чыгат  
//     alert("Эх жаман  болду :(")
// }




// let ER3 = prompt(ER1 + " Сен бүгүн канча кадам кылдың ?")
// for( E1 = 1; E1 < ER3; E1++){
// console.log (E1 );

// }




// let E1 = 1
// while(E1 <= 10){
//     E1++    
//     console.log("Ermek");
    
// }

// for(E2 = 1; E2 <= 10; E2++ ){
//     console.log(E2 +" Ermek");
    
// }









// for(let E1 = 1; E1 <= 10; E1++){
//     if(E1 % 2 === 0){
//         console.log(E1 + " Четные числа/ Жуп сандар ");
//     }  
 
// }




// for(let E2 = 1; E2 <= 15; E2++ ){
//     if( E2 % 3 == 1 ){
//         console.log(E2 + " Нечетные");
        
//     }
// }









