// let a = (12 > 18) ? true : false;
// console.log(a);
// alert(a);





// //! Светофордун светин жазыш керек

// let ER = prompt("Светофордун түзүн жаз" ) // prompt го кандай свет экенин жазат 
// if(ER === "Жашыл"){
//     alert("Жүрө бер")
// }else if(ER === "Сары"){
//     alert("Күтуп тур")
// }else if(ER === "Кызыл"){
//     alert("Токто")
// }else{
//     alert("Белгисиз сигнал")
// };

//         //?! Парол боюнча код

// let ER1 = prompt("Паролду жаз анан киресиң")     //    ER1 ге Парол жазат             
// let ER2 = ER1 === "12345"?"Парол тураа":"Парол тураа эмес";
// alert(ER2)  






                                     //? Практика 



// 1. Температура боюнча баа чыгар

// Колдонуучудан температура сура.

// Эгер температура:

// 0° төмөн болсо → “Муздак”

// 0–20° болсо → “Жылуу”

// 21–35° болсо → “Ысык”

// 35° жогору болсо → “Өтө ысык”
// болсун.


// 👉 Шарт: if / else if / else колдон.


// let ER1 = 15    
// if(ER1 > 35){
//     alert("Өтө ысык")
// }
// else if(ER1 > 21 && ER1 < 34 ){
//     alert("Ысык ")
// }
// else if(ER1 > 1 && ER1 < 20){
//     alert("Жылуу")
// }
// else{
//     alert("Муздак")
// }



// 🧩 2. Тернардык оператор менен кура

// Колдонуучудан жашын сура.
// Эгер жашы 18ден кичине болсо → “Кирүүгө болбойт”,
// болбосо → “Кош келдиңиз!”

// 👉 Шарт: тернардык оператор колдон.

// let ER2 = prompt("Жашыңыз канчада ?")
// let ER3 = ER2 <= 17 ?" Киргенге болбойт": ER2 > 17 ?"Кире бериңиз":"Белгисиз жыл"
// alert(ER3)


// 🧩 3. && жана || менен логика

// Колдонуучудан эки сан сура.
// Эгер эки сандын тең мааниси оң болсо → “Экиси тең оң сан”,
// эгер экөөнүн бири терс болсо → “Бирөө терс сан”,
// эгер экөө тең терс болсо → “Экиси тең терс сан”.

// 👉 Шарт: && жана || колдон.


// ---

// 🧩 4. Пароль текшерүү (2 этап)

// Колдонуучудан эки жолу пароль киргизүүнү сура.

// Эгер экөө тең “js123” болсо → “Пароль туура”

// Эгер экөө ар башка болсо → “Пароль туура эмес”


// 👉 Шарт: prompt, if, else
